jobs-backend/app/controllers/companies_controller.rb

    def index
        @companies = Company.all
---
SELECT "companies".* FROM "companies"

    def show
        @company = Company.find(params[:id])
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]