jobs-backend/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "y"], ["LIMIT", 1]]
---
    def login
        @user = User.find_by(username: params[:username])